[Update] Work flow
